#!/usr/bin/env python3
# Panutad Sirikul (French)
# 650510714
# HW11_EX
# 229223 Sec 001

cat0 = \
    ''' ／|、    
(°、。7   
 |、 ~ヽ  
 ᒐᒐ_f_ )ノ
__________
'''
cat = \
    ''' ／|、    |
(°、。7   |
 |、 ~ヽ  |
 ᒐᒐ_f_ )ノ|
__________|
'''
cat1 = \
    '''            ／|、    
           (°、。7   
            |、 ~ヽ  
            ᒐᒐ_f_ )ノ
           __________
'''
cat2 = \
    ''' ／|、    |          | ／、    
(°、。7   |          |(°、。7   
 |、 ~ヽ  |          | |、 ~ヽ  
 ᒐᒐ_f_ )ノ|          | ᒐᒐ_f_ )ノ
__________|          |__________          
'''
cat_1 = \
    '''                       ／|、    
                      (°、。7   
                       |、 ~ヽ  
                       ᒐᒐ_f_ )ノ
                      __________
'''
cat_2 = \
    '''            ／|、    |          | ／、    
           (°、。7   |          |(°、。7   
            |、 ~ヽ  |          | |、 ~ヽ  
            ᒐᒐ_f_ )ノ|          | ᒐᒐ_f_ )ノ
           __________|          |__________          
''' 
cat3 = \
    ''' ／|、    |                                | ／、    
(°、。7   |                                |(°、。7   
 |、 ~ヽ  |                                | |、 ~ヽ  
 ᒐᒐ_f_ )ノ|                                | ᒐᒐ_f_ )ノ
__________|                                |__________          
'''
def main():
    print(cat_altar(int(input())))


def cat_altar(n):
    if n == 1:
        return (cat0)
    elif n == 2:
        return (cat1 + cat2)
    elif n == 3:
        return (cat_1 + cat_2 + cat3)
    else:
        return cat*n

if __name__ == '__main__':
    main()

